Ell-i/Runtime/stm32/boards.txt
#
# Copyright (c) 2013-2014 ELL-i co-operative
#
# This is part of ELL-i software
#
# ELL-i software is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# ELL-i software is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with ELL-i software.  If not, see <http://www.gnu.org/licenses/>.
#

#
# For more info:
# https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
#

##############################################################

ellduino.name=ELL-i Ell-duino
ellduino.vid.0=XXX
ellduino.pid.0=XXX

ellduino.upload.tool=stm32flash
ellduino.upload.protocol=stm
ellduino.upload.maximum_size=65535
ellduino.upload.speed=57600
ellduino.upload.native_usb=false

ellduino.build.mcu=cortex-m0
ellduino.build.f_cpu=48000000L
ellduino.build.core=arduelli
ellduino.build.board=STM32F051_ELLDUINO
ellduino.build.variant=ellduino
ellduino.build.variant_system_libs=-lstm32f0

ellduino.build.ldscript=ld/flash.ld
ellduino.build.extra_flags=-D__STM32F051__ -DSTM32F0XX

##############################################################

stm32f0discovery.name=ST STM32F0discovery
stm32f0discovery.vid.0=XXX
stm32f0discovery.pid.0=XXX

stm32f0discovery.upload.tool=stflash
stm32f0discovery.upload.protocol=stm
stm32f0discovery.upload.maximum_size=65535
stm32f0discovery.upload.wait_for_upload_port=true
stm32f0discovery.upload.native_usb=true

stm32f0discovery.build.mcu=cortex-m0
stm32f0discovery.build.f_cpu=48000000L
stm32f0discovery.build.board=STM32F051_DISCOVERY
stm32f0discovery.build.core=arduelli
stm32f0discovery.build.variant=stm32f0discovery
stm32f0discovery.build.variant_system_libs=-lstm32f0

stm32f0discovery.build.ldscript=ld/flash.ld
stm32f0discovery.build.extra_flags=-D__STM32F051__ -DSTM32F0XX

##############################################################

stm32f4discovery.name=ST STM32F4 discovery
stm32f4discovery.vid.0=0483
stm32f4discovery.pid.0=3748

stm32f4discovery.upload.tool=st-link
stm32f4discovery.upload.protocol=stm
stm32f4discovery.upload.maximum_size=65535
stm32f4discovery.upload.wait_for_upload_port=true
stm32f4discovery.upload.native_usb=true

stm32f4discovery.build.mcu=cortex-m4
stm32f4discovery.build.f_cpu=168000000L
stm32f4discovery.build.board=STM32F407_DISCOVERY
stm32f4discovery.build.core=arduelli
stm32f4discovery.build.variant=stm32f4discovery
stm32f4discovery.build.variant_system_libs=-lstm32f4

stm32f4discovery.build.ldscript=ld/flash.ld
stm32f4discovery.build.extra_flags=-D__STM32F407__ -DSTM32F40_41xxx

##############################################################

stm32f334nucleo.name=ST STM32F334 nucleo
stm32f334nucleo.vid.0=0483
stm32f334nucleo.pid.0=374B

stm32f334nucleo.upload.tool=st-link
stm32f334nucleo.upload.protocol=stm
stm32f334nucleo.upload.maximum_size=65535
stm32f334nucleo.upload.wait_for_upload_port=true
stm32f334nucleo.upload.native_usb=true

stm32f334nucleo.build.mcu=cortex-m4
stm32f334nucleo.build.f_cpu=72000000L
stm32f334nucleo.build.board=STM32F334_NUCLEO
stm32f334nucleo.build.core=arduelli
stm32f334nucleo.build.variant=stm32f334nucleo
stm32f334nucleo.build.variant_system_libs=-lstm32f3

stm32f334nucleo.build.ldscript=ld/flash.ld
stm32f334nucleo.build.extra_flags=-D__STM32F334__ -DSTM32F334x8
